content/stash/youtube.org
#+startup: content indent

[[file:../index.org][Giovanni's Diary]] > [[file:../subjects.org][Subjects]] > [[file:stash.org][Stash]] >

* Youtube
#+INDEX: Giovanni's Diary!Stash!Youtube

Throughout my life I have had several youtube channels where I
uploaded various types of videos.

My first channel was [[https://www.youtube.com/@San7oS][San7oS]] and was mostly minecraft videos. I
published videos for about 3 years without ever a break, I had a lot
of fun but after a while I got bored. Some time later I began playing
osu! and I uploaded some osu clips on [[https://www.youtube.com/@san7ososu404][San7oS Osu!]].

As I began playing games less and less I started concentrating on
other things. I opened [[https://www.youtube.com/@giovannisantini6094][Giovanni Santini]] as a creative outlet where I
posted some piano plays. In university I opened [[https://www.youtube.com/@giovannis-diary][Giovanni's Diary]]
mostly focused on coding, and [[https://www.youtube.com/@Giogames-d6f][Giogames]] where I post clip of [[file:videogames/videogames.org][videogames]]
I play, even though I don't play in recent years.

-----

Travel: [[file:stash.org][Stash]], [[file:../theindex.org][Index]] 
