public/stash/youtube.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../subjects.html">Subjects</a> &gt; <a href="stash.html">Stash</a> &gt;
</p>
<div id="outline-container-orga8dbb8c" class="outline-2">
<h2 id="orga8dbb8c">Youtube</h2>
<div class="outline-text-2" id="text-orga8dbb8c">
<p>
Throughout my life I have had several youtube channels where I
uploaded various types of videos.
</p>

<p>
My first channel was <a href="https://www.youtube.com/@San7oS">San7oS</a> and was mostly minecraft videos. I
published videos for about 3 years without ever a break, I had a lot
of fun but after a while I got bored. Some time later I began playing
osu! and I uploaded some osu clips on <a href="https://www.youtube.com/@san7ososu404">San7oS Osu!</a>.
</p>

<p>
As I began playing games less and less I started concentrating on
other things. I opened <a href="https://www.youtube.com/@giovannisantini6094">Giovanni Santini</a> as a creative outlet where I
posted some piano plays. In university I opened <a href="https://www.youtube.com/@giovannis-diary">Giovanni's Diary</a>
mostly focused on coding, and <a href="https://www.youtube.com/@Giogames-d6f">Giogames</a> where I post clip of <a href="videogames/videogames.html">videogames</a>
I play, even though I don't play in recent years.
</p>

<hr />

<p>
Travel: <a href="stash.html">Stash</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
